2.2.013/src/InformationRegisters/МК_МоиЗадания/МК_МоиЗадания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МК_МоиЗадания</name>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ВидОтсутствия</name>
    <type>
      <types>CatalogRef.МК_СоответствиеОтсутствий</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Целосменный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КолвоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КолвоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>CatalogRef.МК_ЗаявкиНаОтсутствие</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

2.2.013/src/Enums/МК_СтатусыЗаявокНаОтсутствия/МК_СтатусыЗаявокНаОтсутствия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_СтатусыЗаявокНаОтсутствия</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Необработана</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/InformationRegisters/МК_МоиЗадания/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Функция СоздатьДокументНаСервере() 
	мВозврат = Новый Массив;	
	мИмяФормы = Неопределено;
	мОбъект = Запись.Заявка.ПолучитьОбъект();                               

	мВидЗаявки = мОбъект.ВидЗаявки; 	
	
	Если мВидЗаявки = 1 Тогда           // Добавление сотрудника.
		мЗначения = Новый Структура("Фамилия, Имя, Отчество", мОбъект.Фамилия, мОбъект.Имя, мОбъект.Отчество); // Задаем реквизиты  
		мЗначения.Вставить("Действие", "ЗаполнитьПоПараметрамЗаполнения");  		 
		мВозврат.Добавить("Справочник.Сотрудники.Форма.ФормаЭлемента");
		мВозврат.Добавить(мЗначения);
		мВозврат.Добавить(1);
        Возврат мВозврат;
	ИначеЕсли мВидЗаявки = 0 Тогда
		мПараметры = Новый Структура("Основание,ОсновнойОтпуск",,Ложь);
	
		мЗначения = Новый Структура("Организация, Сотрудник", мОбъект.Организация, мОбъект.Сотрудник);
		ДанныеОтсутствия = Неопределено;   
		мВидОтсутствия = мОбъект.ВидДокумента1С;

		Если мВидОтсутствия.Предопределенный Тогда  // Предопределенные элементы   
			мПараметры = Новый Структура;
			Если мВидОтсутствия.Объект1С = "Командировка" Тогда     
				мИмяФормы = "Документ.Командировка.Форма.ФормаДокумента";    
				мЗначения.Вставить("ДатаНачала", мОбъект.ДатаНачалаОтсутствия);
				мЗначения.Вставить("ДатаОкончания", мОбъект.ДатаЗавершенияОтсутствия);
				мЗначения.Вставить("ДатаКомандировки", мОбъект.ДатаНачалаОтсутствия);
				мЗначения.Вставить("ДатаНачалаСобытия", мОбъект.ДатаНачалаОтсутствия);
			    мЗначения.Вставить("ВнутрисменнаяКомандировка", НЕ мОбъект.Целосменный);
				мЗначения.Вставить("ОплачиватьЧасов", мОбъект.КолвоЧасовОтсутствия);    
				мЗначения.Вставить("Действие", "Заполнить"); 
				мЗначения.Вставить("ЗаполнитьПоПараметрамЗаполнения", Истина);    
				мПараметры.Вставить("Основание", мЗначения);
			ИначеЕсли мВидОтсутствия.Объект1С = "Отгул" Тогда    
				мИмяФормы = "Документ.Отгул.Форма.ФормаДокумента";    
				мЗначения.Вставить("ДатаНачала", мОбъект.ДатаНачалаОтсутствия);
				мЗначения.Вставить("ДатаОкончания", мОбъект.ДатаЗавершенияОтсутствия);
				//мЗначения.Вставить("ДатаОтсутствия", Объект.ДатаНачала);			
		    	//мЗначения.Вставить("ВнутрисменнаяКомандировка", НЕ мОбъект.Целосменный);
				//мЗначения.Вставить("ОплачиватьЧасов", мОбъект.КолвоЧасовОтсутствия);    
				мЗначения.Вставить("Действие", "Заполнить"); 
				мЗначения.Вставить("ЗаполнитьПоПараметрамЗаполнения", Истина);    
				мПараметры.Вставить("Основание", мЗначения);				
			ИначеЕсли мВидОтсутствия.Объект1С = "Отпуск по беременности и родам" Тогда	    
				    				
			ИначеЕсли мВидОтсутствия.Объект1С = "Отпуск по уходу за ребенком" Тогда	 
				мИмяФормы = "Документ.ОтпускПоУходуЗаРебенком.Форма.ФормаДокумента";    
				мЗначения.Вставить("ДатаНачала", мОбъект.ДатаНачалаОтсутствия);
				мЗначения.Вставить("ДатаОкончания", мОбъект.ДатаЗавершенияОтсутствия);
				мЗначения.Вставить("ДатаНачалаПФР", мОбъект.ДатаНачалаОтсутствия);
				мЗначения.Вставить("ОсновнойСотрудник", мОбъект.Сотрудник);     
				мЗначения.Вставить("Сотрудник", мОбъект.Сотрудник.ФизическоеЛицо);
				мЗначения.Вставить("Действие", "ЗаполнитьПоПараметрамЗаполнения"); 
				мПараметры.Вставить("Основание", мЗначения); 
			ИначеЕсли мВидОтсутствия.Объект1С = "Больничный лист" Тогда	   
				мПозицияСелектора = 0;  // Больничный
				мИмяФормы = "Документ.ПрогулНеявка.Форма.ФормаДокумента";    
				мЗначения.Вставить("ДатаНачала", мОбъект.ДатаНачалаОтсутствия);
				мЗначения.Вставить("ДатаОкончания", мОбъект.ДатаЗавершенияОтсутствия);		    			
				мЗначения.Вставить("Действие", "ЗаполнитьПоПараметрамЗаполнения");  		 
				// ОтсутствиеВТечениеЧастиСмены - БЛ не может быть внутрисменным
				//мЗначенияВставить("ВидОтсутствия",ПланВидовРасчетаСсылка.Начисления.Отсутствие по болезни (больничный еще не закрыт)); 			
				//мЗначения.Вставить("ВидОтсутствия",Болезнь());  
				мЗначения.Вставить("СостояниеСотрудника", Перечисления.СостоянияСотрудника.Болезнь);
				мПараметры.Вставить("Основание", мЗначения);
			КонецЕсли;			
		Иначе                  // Отпуска.                            
			мПараметры = Новый Структура("Основание,ОсновнойОтпуск",,Ложь);
			мВидОтпуска = мВидОтсутствия.Объект1С;		 
    	
			Если мВидОтпуска.ОтпускБезОплаты = Истина Тогда   // Создаем документ "Отпуск без оплаты"    
				мИмяФормы = "Документ.ОтпускБезСохраненияОплаты.Форма.ФормаДокумента";   
				//ДанныеОтпуска = ДанныеОтпусков(Справочники.ВидыОтпусков.ОтпускЗаСвойСчет, мЗначения.Сотрудник, мОбъект);
				ДанныеОтсутствия = ДанныеОтпусков(мВидОтпуска, мЗначения.Сотрудник, мОбъект);    
				мЗначения.Вставить("ОтсутствиеВТечениеЧастиСмены", Не мОбъект.Целосменный);      
				мЗначения.Вставить("ЧасовОтпуска",мОбъект.КолвоЧасовОтсутствия);
			ИначеЕсли мВидОтпуска.ОтпускЯвляетсяЕжегодным Тогда                             // Тут - обычный отпуск     
				мИмяФормы = "Документ.Отпуск.Форма.ФормаДокумента";    
				Если ПолучитьФункциональнуюОпцию("ИспользоватьОбщийПериодОтпускаВДокументах") Тогда
					мПараметры.ОсновнойОтпуск = Истина;
					мПараметры.Вставить("НачалоОтпуска", мОбъект.ДатаНачалаОтсутствия);
					мПараметры.Вставить("ОкончаниеОтпуска", мОбъект.ДатаЗавершенияОтсутствия);
				Иначе
					мПараметры.ОсновнойОтпуск = Истина;
					ДанныеОтсутствия = ДанныеОтпусков(Справочники.ВидыОтпусков.Основной, мЗначения.Сотрудник, мОбъект);
				КонецЕсли;   
				мЗначения.Вставить("ДатаНачалаОсновногоОтпуска",мОбъект.ДатаНачалаОтсутствия);
				мЗначения.Вставить("ДатаОкончанияОсновногоОтпуска",мОбъект.ДатаНачалаОтсутствия);    
				мЗначения.Вставить("УчитыватьМРОТПриОплатеПоСреднемуЗаработку",Истина);   
			Иначе
				мИмяФормы = "Документ.Отпуск.Форма.ФормаДокумента";    
				ДанныеОтсутствия = ДанныеОтпусков(мВидОтпуска, мЗначения.Сотрудник, мОбъект);				
			КонецЕсли;	                     
		
			мЗначения.Вставить("Ссылка", Неопределено);
			мЗначения.Вставить("Действие", "Заполнить");  
		
			ДанныеОтсутствий = Новый Массив;
			Если ЗначениеЗаполнено(ДанныеОтсутствия) Тогда
				ДанныеОтсутствий.Добавить(ДанныеОтсутствия);
			КонецЕсли;
		    мЗначения.Вставить("ДанныеОтпусков", ДанныеОтсутствий);
			мПараметры.Основание = мЗначения;
		КонецЕсли;			
	КонецЕсли;
	мВозврат.Добавить(мИмяФормы);
	мВозврат.Добавить(мПараметры);
	мВозврат.Добавить(0);
	Возврат мВозврат;
Конецфункции               

//&НаСервереБезКонтекста
//Функция Болезнь()
//	мВидБолезнь = ПланыВидовРасчета.Начисления.НайтиПоНаименованию("Отсутствие по болезни (больничный еще не закрыт)"); 
//	Возврат мВидБолезнь;
//КонецФункции	


&НаСервере
Функция ДанныеОтпусков(ВидОтпуска, Сотрудник, мОбъект)
	
	ВидОтпускаРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидОтпуска, "СпособРасчетаОтпуска, ОтпускЯвляетсяЕжегодным");
	
	ДанныеОтпуска = НовыйДанныеОтпуска();
	ДанныеОтпуска.ВидОтпуска = ВидОтпуска; 
	ДанныеОтпуска.ДатаНачала = мОбъект.ДатаНачалаОтсутствия;
	ДанныеОтпуска.ДатаОкончания = мОбъект.ДатаЗавершенияОтсутствия;
	ДанныеОтпуска.КоличествоДней = мОбъект.КолвоДнейОтсутствия;
	ПоКалендарнымДням = (ВидОтпускаРеквизиты.СпособРасчетаОтпуска = Перечисления.СпособыРасчетаОтпуска.ВКалендарныхДнях);   
	Если ДанныеОтпуска.КоличествоДней = 0 Тогда
		ДанныеОтпуска.КоличествоДней = 
			УчетРабочегоВремениРасширенный.ДлительностьИнтервала(Сотрудник, мОбъект.ДатаНачалаОтсутствия,
															 мОбъект.ДатаЗавершенияОтсутствия, ПоКалендарнымДням, 
															 ВидОтпускаРеквизиты.ОтпускЯвляетсяЕжегодным);
	КонецЕсли;														 

	Возврат ДанныеОтпуска;
	
КонецФункции  

&НаКлиентеНаСервереБезКонтекста
Функция НовыйДанныеОтпуска()
		
	СтруктураОтпуска = Новый Структура;
		
	СтруктураОтпуска.Вставить("ВидОтпуска");
	СтруктураОтпуска.Вставить("ДатаНачала", Дата(1, 1, 1, 0, 0, 0));
	СтруктураОтпуска.Вставить("ДатаОкончания", Дата(1, 1, 1, 0, 0, 0));
	СтруктураОтпуска.Вставить("КоличествоДней");
	СтруктураОтпуска.Вставить("КоличествоДнейКомпенсации", 0);
	//СтруктураОтпуска.Вставить("НачалоПериодаЗаКоторыйПредоставляетсяОтпуск", '00010101');
	//СтруктураОтпуска.Вставить("КонецПериодаЗаКоторыйПредоставляетсяОтпуск", '00010101');
	СтруктураОтпуска.Вставить("Основание", "");
	СтруктураОтпуска.Вставить("ВидОтпускаПрежний", Неопределено);
	СтруктураОтпуска.Вставить("ИндексСтрокиДокумента", Неопределено);
	
	Возврат СтруктураОтпуска;
	
КонецФункции



&НаКлиенте
Процедура СоздатьДокумент(Команда)
	мРезультат = СоздатьДокументНаСервере();   
	мИмяФормы = мРезультат[0];
	Если мИмяФормы = Неопределено Тогда
		Сообщить("Такой вид документа пока не может быть создан");
	Иначе	
		Если мРезультат[2] = 1 Тогда   // Создаем сотрудника   			 
			мЗначенияЗаполнения = Новый Структура("ЗначенияЗаполнения",мРезультат[1]);  
			ОткрытьФорму(мИмяФормы, мЗначенияЗаполнения, ЭтаФорма, Истина);	
		Иначе			
			мПараметры = мРезультат[1];  
			ОткрытьФорму(мИмяФормы, мПараметры, ЭтаФорма, Истина);
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ОтклонитьНаСервере()       
	мОбъект = Запись.Заявка.ПолучитьОбъект();
	мОбъект.СтатусЗаявки = Перечисления.МК_СтатусыЗаявокНаОтсутствия.Отклонена;	     
	мОбъект.Записать();
	// Надо удалить все записи с этой заявкой в регистре МК_МоиЗадания
	Набор = РегистрыСведений.МК_МоиЗадания.СоздатьНаборЗаписей();
	Набор.Отбор.Заявка.Установить(Запись.Заявка);	
	Набор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ОтклонитьНаСервере(); 
	ЭтаФорма.ВладелецФормы.Обновить();  
	ЭтаФорма.Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Параметр - ссылка на документ. Надо прописать ее в заявку, если документ записан  
	мНашеОповещение = Ложь;
	Если (ИмяСобытия = "ЗаписанДокументОтпуск" ИЛИ 
		ИмяСобытия = "ЗаписанДокументОтпускБезСохраненияОплаты") 
		И Источник.ВладелецФормы = ЭтаФорма Тогда
		//ЗаполнитьОтсутствияПоДругимМестамРаботы();    
		ОбработатьЗаявку(Параметр);  
		мНашеОповещение = Истина;
	ИначеЕсли ИмяСобытия = "ЗаписьДокументаКомандировка"  И Источник = ЭтаФорма Тогда 
		ОбработатьЗаявку(Параметр.Ссылка);
		мНашеОповещение = Истина;
	ИначеЕсли ИмяСобытия = "Запись_ПрогулНеявка" Тогда    
		// Почему-то в параметрах оповещения для прогула/неявки нет ссылки на форму-владельца. Сделаем проверку по реквизитам документа: если сотрудник
		// и дата начала события совпадают, будем считать, что это наш документ.
		мСтр = ПолучитьСотрудникаИДаты(Источник);
		Если мСтр.Сотрудник = ЭтаФорма.Запись.Сотрудник И мСтр.ДатаНачала = ЭтаФорма.Запись.ДатаНачала Тогда
			мНашеОповещение = Истина;
			ОбработатьЗаявку(Источник);
		КонецЕсли;			             
	ИначеЕсли ИмяСобытия = "Запись_Отгул"  Тогда 
		мСтр = ПолучитьСотрудникаИДаты(Источник);
		Если мСтр.Сотрудник = ЭтаФорма.Запись.Сотрудник И мСтр.ДатаНачала = ЭтаФорма.Запись.ДатаНачала Тогда
			мНашеОповещение = Истина;
			ОбработатьЗаявку(Источник);
		КонецЕсли;	
	ИначеЕсли ИмяСобытия = "Запись_ОтпускПоУходуЗаРебенком"  Тогда 
		мСтр = ПолучитьСотрудникаИДаты(Источник);
		Если мСтр.Сотрудник =  ФизЛицоСотрудника( ЭтаФорма.Запись.Сотрудник) И мСтр.ДатаНачала =  ЭтаФорма.Запись.ДатаНачала Тогда
			мНашеОповещение = Истина; 
			ОбработатьЗаявку(Источник);			
		КонецЕсли;		
	КонецЕсли;	
	Если мНашеОповещение Тогда	
		ЭтаФорма.ВладелецФормы.Обновить();  
		ЭтаФорма.Закрыть();	
	КонецЕсли;	
КонецПроцедуры  

&НаСервереБезКонтекста 
Функция ФизЛицоСотрудника(мСсылка)
	Возврат мСсылка.ФизическоеЛицо;
КонецФункции

&НаСервере
Процедура ОбработатьЗаявку(мСсылкаНаДокумент)       
	мОбъект = Запись.Заявка.ПолучитьОбъект();
	мОбъект.СтатусЗаявки = Перечисления.МК_СтатусыЗаявокНаОтсутствия.Выполнена;	     
	мОбъект.Документ1С = мСсылкаНаДокумент;
	мОбъект.Записать();
	// Надо удалить все записи с этой заявкой в регистре МК_МоиЗадания
	Набор = РегистрыСведений.МК_МоиЗадания.СоздатьНаборЗаписей();
	Набор.Отбор.Заявка.Установить(Запись.Заявка);	
	Набор.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСотрудникаИДаты(мСсылка)	
	мВозврат = Новый Структура("Сотрудник, ДатаНачала",мСсылка.Сотрудник,мСсылка.ДатаНачала);
	Возврат мВозврат;
КонецФункции
